Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: Some pages declare that they can provide you with free game resources.
pt_pt: Algumas páginas afirmam que podem dar-te recursos grátis para o jogo.

source: Please note that that's a scam, and your personal information may be stolen if you use their services.
pt_pt: Tem em atenção que isso é uma burla e que as tuas informações pessoais podem ser roubadas se usares esses serviços.

source: The only way to earn game resources is to actually play the game and take part in our official contests here: https://www.facebook.com/IslandQuestaway/
pt_pt: A única forma de ganhar recursos para o jogo é jogar o título e participar nos concursos oficiais, aqui: https://www.facebook.com/IslandQuestaway/

source: Get these comfy onesies for Iris, Astrid, and Heidi!
pt_pt: Obtém estes macacões para a Iris, a Astrid e a Heidi!

source: Buy resources and upgrade Astrid's new skin in the event shop!
pt_pt: Compra recursos e melhora o visual da Astrid na loja do evento!

source: If you still experience this issue, please report it to our support team, our specialists will help you as soon as possible!
pt_pt: Se continuares com este problema, informa a nossa equipa de suporte e os nossos especialistas irão ajudar-te logo que possível!

source: You can use this link to make a request: bit.ly/HWSupport
pt_pt: Utiliza este link para fazer o pedido: bit.ly/HWSupport

source: Oh, we're sorry that you've encountered such an issue :( We’d kindly appreciate it if you wrote to the game support team using this link: bit.ly/IQ_support Be sure that we’ll do all we can to help you fix the problem!
pt_pt: Oh, lamentamos muito que tenhas encontrado um problema como esse :( Seria ótimo se pudesses escrever para a equipa de suporte através desta ligação: bit.ly/IQ_support Podes ter a certeza que vamos fazer tudo para te ajudar com o teu problema!

source: Play the game daily throughout November and earn Soul Stones for the legendary Dominion Guardian Galahad!
pt_pt: Em novembro, joga todos os dias e ganha Pedras Anímicas para Galahad, um Guardião Lendário do Domínio!

source: Generous offers and trophies await! Time to get some valuable resources, including Soul Stones for your Eternity Heroes!
pt_pt: Obtém ofertas e troféus generosos como recursos valiosos, incluindo pedras anímicas para os teus Heróis da Eternidade!

source: Sometimes defeating the enemy isn’t so easy, but extra resources might just improve your chance of winning! Participate in exciting seasonal events, complete quests, and earn new Battle Pass points! Collect useful resources from all 40 levels of the pass and reach the bonus trophies: Artifact Fragments for Folio and a Solar Skin for Cornelius! Get even stronger and conquer new heights!
pt_pt: Derrotar o inimigo pode não ser fácil, mas recursos extra vão ajudar! Participa nos eventos da temporada, conclui missões e ganha pontos no novo Passe de Batalha! Obtém recursos úteis nos 40 níveis do passe e ganha os troféus de bónus: Fragmentos de Artefactos para Folio e um Visual Solar para Cornelius! Melhora a tua força! O céu é o limite!

source: Another serving of great bonuses coming right up!
pt_pt: Há mais bónus a chegar!

source: Complete the seasonal event quests during the month, earn Battle Pass Points, and obtain resources.
pt_pt: Este mês, conclui as missões do evento sazonal, ganha Pontos do Passe de Batalha e obtém recursos.

source: The most driven Heroes can even get their hands on the super loot—Soleil's Artifact Fragments and a resplendent Solar Skin for Amira!
pt_pt: Os Heróis mais diligentes podem até ganhar algo especial: Fragmentos de Artefacto para Soleil e um Visual Solar para Amira!

source: It's time to stock up!
pt_pt: Faz-te aos prémios!

source: RETRY NOW!
pt_pt: TENTA LÁ, VÁ!

source: Stock up on the essentials and try out the new Cybernetic Skins!
pt_pt: Obtém recursos essenciais e experimenta os novos visuais Cibernéticos!

source: • Astaroth’s new skin will increase his magic defense.
pt_pt: • O novo visual de Astaroth vai melhorar a sua defesa mágica.

source: Wonders of the Winterfest Dominion New Upgrade for Amira Is there any better present than a talisman holding incredible power?
pt_pt: Maravilhas do Festival de Inverno do Domínio Nova Melhoria para Amira Haverá um presente melhor do que um talismã contendo um poder incrível?

source: Open this gift and upgrade Amira's new artifact to help her secure many victories in the coming year!
pt_pt: Abre este presente e melhora o novo artefacto de Amira para a ajudar a conseguir uma série de vitórias no próximo ano!

source: Feel the festive spirit!
pt_pt: Sente o espírito festivo!

source: Thank you very much for detailed feedback!
pt_pt: Muito obrigado pela avaliação detalhada!

source: Hero Wars: Get Those Levels ⚔️
pt_pt: Hero Wars: Sobe de Nível ⚔️

source: The world of Dominion is waiting for you to stake your claim in Hero Wars
pt_pt: O mundo do Domínio quer que deixes a tua marca em Hero Wars

source: EXP Booster: Even Stronger Heroes
pt_pt: Reforço de EXP: heróis ainda mais fortes

source: Join the competition with your guild!
pt_pt: Junta-te à competição com a tua guilda!

source: Account
pt_pt: Conta

source: The Dark Sorceress’s Hunt has started!
pt_pt: A Caçada da Feiticeira Sombria começou!

source: Will you be brave enough to stand in the way of magic?
pt_pt: Tens o que é preciso para repelir a sua magia?

source: A mysterious threat has forced the forest dwellers and Heroes of Dominion into battle.
pt_pt: Uma ameaça misteriosa forçou os habitantes da floresta e os heróis do Domínio a lutar.

source: Will you help them defeat evil?
pt_pt: Vais ajudá-los a derrotar o mal?

source: New Solar Skins to look as crisp as ever!
pt_pt: Novos Visuais Solares mais escaldantes do que nunca!

source: And a Soul Stone event to top it off!
pt_pt: E sem esquecer um evento de Pedra de Alma!

source: Error 500:</br> Internal Server Error
pt_pt: Erro 500:</br> Erro interno do servidor

source: Magic Tree
pt_pt: Árvore Mágica

source: Join the Big Sale and try the improved Thea!
pt_pt: Espreita a Thea melhorada na Grande Promoção!

source: Thank you for your feedback!
pt_pt: Obrigado pela tua avaliação!

source: We have taken some creative liberty in how we present the game in our advertisements to appeal to a wider audience, even those who have not previously played any RPG games.
pt_pt: Tentámos ser criativos ao apresentar e anunciar o jogo de forma a agradar a uma audiência mais ampla, incluindo quem nunca jogou jogos RPG.

source: Nevertheless, we will continue to improve our game and advertisements based on your feedback.
pt_pt: No entanto, continuaremos a melhorar o jogo e os anúncios com base na tua avaliação.

source: You can now check out our new Tower game in Hero Wars!
pt_pt: Já podes experimentar o modo Torre no Hero Wars!

source: Unleash your heroes’ immense power once again!
pt_pt: Liberta mais uma vez o imenso poder dos teus heróis!

source: Assemble your dream team with this rookie and watch him take part in all-out battles with no holds barred!
pt_pt: Reúne a tua equipa de sonho com a ajuda deste novato e vê-o a participar em grandes lutas!

source: Defeat your opponents, earn Soul Stones, and promote Folio to 2 stars!
pt_pt: Derrota os teus adversários, ganha Pedras Anímicas e promove Folio a 2 estrelas!

source: Check out the shop and buy valuable resources for him and Martha!
pt_pt: Espreita a loja e compra recursos valiosos para ele e para a Martha!

source: Knowledge is power, remember that!
pt_pt: Lembra-te: conhecimento é poder!

source: - Opening chests became easier.
pt_pt: - Agora é mais simples abrir baús.

source: Open several at a time!
pt_pt: Abre vários ao mesmo tempo!

source: Back to the Game
pt_pt: Voltar ao jogo

source: Log in every day this December to upgrade this Way of Chaos sorceress!
pt_pt: Inicia sessão diariamente em dezembro e melhora a feiticeira do Caminho do Caos!

source: SUCH A SHAME!
pt_pt: OH, QUE PENA!

source: This summer is full of surprises!
pt_pt: Este verão está cheio de surpresas!

source: Update for the whole world Heroes are not the only ones working to make the Dominion a better place.
pt_pt: Atualização mundial Os heróis não são os únicos a tentar melhorar o Domínio.

source: Translators from all over the world are pitching in, too!
pt_pt: Por todo o mundo, um exército de tradutores também contribui para isso!

source: With this update, we've improved the existing translations and added a new one, so now you can also play in Polish!
pt_pt: Esta atualização melhora as traduções existentes e adiciona um novo idioma ao jogo, o polaco!

source: Play together, no matter where you are!
pt_pt: Joga com amigos de todo o mundo!

source: Unity of the Damned!
pt_pt: Unidade dos Malditos!

source: Reign of Chaos!
pt_pt: Reino do Caos!

source: Punishing Hand
pt_pt: Mão Punitiva

source: Get the most out of our new Battle Pass!
pt_pt: Aproveita o novo Passe de Batalha!

source: We completely understand what you mean — it can get quite challenging exploring the mysterious lands of the island Don't forget to use all the means of earning energy!
pt_pt: Compreendemos que pode ser muito desafiante explorar a Ilha Não te esqueças de usar todas as formas de ganhar energia!

source: You can create energy in the cauldron, find it in amphoras on the Island, earn energy from completing boat orders ⛵️ Also, reaching a new level fills the energy bar to the max ⚡️
pt_pt: Podes criar energia no caldeirão, encontrá-la em ânforas na Ilha ou ganhar energia quando concluis ordens do barco ⛵ E quando atinges um nível novo, renovas a barra de energia ⚡️

source: This Month's Hero is Dorian
pt_pt: O Herói deste mês é Dorian

source: Canadian Dollar
pt_pt: Dólar canadiano

source: An eerie update!
pt_pt: Uma atualização tenebrosa!

source: Morrigan's Buff The necromancer now summons more skeletons and reaps a grim advantage from other heroes reviving.
pt_pt: Efeito da Morrigan A necromante agora invoca mais esqueletos e ganha vantagem ao reanimar heróis.

source: New Brawls Assemble a team with Morrigan and others to check her out in battle.
pt_pt: Novas Brigas Junta uma equipa com a Morrigan para a veres em ação.

source: Fight, win, and earn rewards!
pt_pt: Luta, vence e ganha recompensas!

source: Generals' Commands in Global Championship That's right!
pt_pt: Comandos de Generais no Campeonato Global Pois é!

source: Starting on June 21, Generals' commands will be available in the Global Championship, which is a huge quality-of-life improvement for both generals and champions.
pt_pt: A partir de 21 de junho, podes usar Comandos de Generais no Campeonato Global, algo bem útil tanto para generais como campeões.

source: Give those bones a good shake!
pt_pt: Sacode bem esses ossos!

source: More Mini Games
pt_pt: Mais minijogos

source: Here you need to position the rails so that the plate below could make its way up to the grey square.
pt_pt: Aqui tens de posicionar os carris para que a placa em baixo consiga subir até ao quadrado cinzento.

source: Good luck with the quest!
pt_pt: Boa sorte com esta missão!

source: Adventure awaits! Lara Croft is our new hero! The legendary tomb raider is setting of on a special adventure with the Guardians! You’ll be able to add Lara to your team during this exciting two-week event, as well as earn three stylish skins and powerful talismans for her! Updated Hero’s Way Your heroics will now earn even more generous rewards! Don’t forget to complete event quests to earn Hero’s Way points and earn lots of unique rewards. Discover the secrets of Dominion!
pt_pt: A aventura aguarda-te! Lara Croft é a nova heroína! A lendária invasora de túmulo prepara-se para uma aventura com os Guardiões! Adiciona Lara à tua equipa durante este evento de duas semanas e ganha três visuais estilosos e poderosos talismãs! Caminho do Herói Melhorado! Os teus heróis irão agora ganhar ainda mais generosas recompensas! Não te esqueças de concluir missões de eventos para ganhar mais pontos do Caminho do Herói e montes de recompensas. Descobre os segredos do Domínio!

source: Take part in a winter adventure!
pt_pt: Participa na aventura de inverno!

source: Grow your Magic Tree, join fights, get lots of rewards, and have fun!
pt_pt: Cultiva a Árvore Mágica, entra em combates, obtém montes de recompensas e diverte-te!

source: I had a YEAR raid!!!
pt_pt: Passei um ano no raid!!!

source: Useful update!
pt_pt: Atualização útil!

source: 5 LEVELS LATER
pt_pt: 5 NÍVEIS MAIS TARDE

source: An event never seen before!
pt_pt: Evento inédito!

source: Complete quests to level up your Battle Pass, the key to earning amazing rewards!
pt_pt: Faz missões para melhorar o Battle Pass e ganhar recompensas épicas!

source: Upgrade your Battle Pass to Golden Tier, and let the prizes flow like water!
pt_pt: Chega ao Nível Gold do Battle Pass para veres toda uma torrente de prémios!

source: Dominion is gripped by an uncanny heat!
pt_pt: Está uma tosta no Domínio!

source: Oya shines blindingly in her new costume while the store shelves melt under the hottest deals!
pt_pt: As novas roupas da Oya são resplandecentes e as prateleiras das lojas estão a abarrotar com descontos escaldantes!

source: Take part in a sweltering delight: complete event quests to earn as many coins as possible and buy up loads of resources!
pt_pt: Participa neste evento fenomenal: conclui missões do evento, ganha pilhas de moedas e compra toneladas de recursos!

source: Oya’s new Solar Skin, which can be upgraded even further, will be available in the shop alongside four times the usual emeralds and lots of discounts!
pt_pt: Na loja poderás comprar o novo Visual Solar da Oya, que pode ser melhorado, assim como o quádruplo das esmeradas e montes de descontos!

source: To top it off, you’ll later be able to buy Summoning and Elemental Spheres at half price!
pt_pt: Além disso, também poderás comprar Esferas de Invocação e Elementais a metade do preço!

source: Celebrate the Autumn Festival!
pt_pt: Celebra o Festival de Outono!

source: So nice to see you tried our game out!
pt_pt: Que bom que experimentaste o nosso jogo!

source: Knowing you are concerned with our ad makes us feel uneasy, though.
pt_pt: Porém, saber que estás preocupado com o anúncio faz-nos sentir apreensivos.

source: We sure hope you won't feel bad about it once you give our game a chance.
pt_pt: Esperamos que te sintas melhor quando deres uma oportunidade ao jogo.

source: We are constantly improving our game mechanics, so you can already try the Tower gameplay in Hero Wars, which will reward you with Gold, Energy and even Heroes!
pt_pt: Procuramos melhorar e atualizar regularmente a jogabilidade, por isso já podes experimentar o modo Torre no Hero Wars e ganhar Ouro, Energia e até Heróis!

source: Participate in the unique event and earn prizes!
pt_pt: Participa neste evento único e ganha prémios!

source: The winter brings new challenges and Winterfest skins for your Heroes!
pt_pt: O inverno trás desafios e visuais do Festival de Inverno para os seus Heróis!

source: We're sorry to hear that you've faced issues with the game We’d really appreciate it if you could contact our support team so that they could thoroughly investigate the problem.
pt_pt: Lamentamos saber que tiveste problemas com o jogo Agradecíamos imenso se pudesses contactar a nossa equipa de suporte para que possam investigar o problema.

source: To do so, tap the Support button in the game settings.
pt_pt: Para tal, toca no botão Suporte nas definições do jogo.

source: There is a legend about the blackest of Fridays, when a terror of multiple discounts falls upon Dominion... and this Halloween, the legend is coming true! Complete special quests and spend Coins in the event shop! Great discounts of up to 55% and 4 times more resources with each purchase await; don’t miss out on the chance to stock up on Soul Stones for your Eternity Heroes, guild bundles, a new frame, and an avatar! Team up with the nightmare!
pt_pt: Há uma lenda em torno da Black Friday, o dia em que os descontos assolam o Domínio... Neste Halloween, a lenda ganha vida! Conclui missões especiais e gasta Moedas na loja do evento! Esperam-te descontos de até 55% e 4 vezes mais recursos com cada compra. Não percas a oportunidade de adquirir Pedras Anímicas para os teus Heróis da Eternidade, pacotes de guilda, uma nova moldura e um avatar! O pesadelo chegou!

source: Defeat the boss!
pt_pt: Derrota o boss!

source: SHOULD WE HAVE A KID?
pt_pt: VAMOS TER UMA CRIANÇA?

source: Take part in a new PvP challenge and win!
pt_pt: Participa e triunfa no novo desafio PvP!

source: These exclusive skins are only available during the special event, don’t miss your chance to get them!
pt_pt: Estes visuais exclusivos só estão disponíveis durante o evento, não percas a oportunidade de os obter!

source: INSTALL
pt_pt: INSTALAR

source: From now on your Throne Rush account is connected to your e-mail and more than protected.
pt_pt: A partir de agora, a tua conta Throne Rush está associada ao teu e-mail e ainda mais protegida.

source: Spring is at its peak in the Dominion!
pt_pt: O Domínio está no auge da primavera!

source: And with it, exciting festivities are coming!
pt_pt: Por isso, podes contar com festejos incríveis!

source: It's nightmare season!
pt_pt: É a temporada do pesadelo!

source: Dress up your Heroes to celebrate the occasion and give them demonic powers with new skins!
pt_pt: Veste os teus heróis para celebrar a ocasião e dá-lhes poderes demoníacos com novos visuais!

source: Free the Leprecats!
pt_pt: Liberta os gnomolinos!

source: Help the furry cuties and get some handy items as a reward!
pt_pt: Ajuda os felpudos e obtém alguns itens como recompensa!

source: The long awaited return of Tenebris and Brawls!
pt_pt: Tenebris e as Brigas estão de volta!

source: New frames and avatars: elegant as ever
pt_pt: Novas molduras e avatares: mais elegância do que nunca

source: Buy the souls of Nebula & K'arkh for silver trophies
pt_pt: Compra as almas de Nebula e K'arkh para obter troféus de prata

source: Jump on this chance to join the Way of Chaos special event, upgrade Lilith, and get many useful rewards!
pt_pt: Junta-te ao evento especial do Caminho do Mistério, melhora Lilith e obtém muitas recompensas úteis!

source: Artifact Chest!
pt_pt: Baú de Artefactos!

source: COLLECT UNIQUE HEROES!
pt_pt: COLECIONA HERÓIS ÚNICOS!

source: Universal Titan Brawl
pt_pt: Briga Universal de Titãs

source: Unique new Angelic Skins for Lars and Krista!
pt_pt: Visuais Angélicos únicos para Lars e Krista!

source: A new Titan Brawl begins, open to all!
pt_pt: Começa uma nova Briga de Titãs, aberta a todos!

source: Here's the Magic Tree!
pt_pt: Cá está a Árvore Mágica!

source: Shadows of the Past!
pt_pt: Sombras do Passado!

source: Honey, I'm back home!
pt_pt: Querida, voltei!

source: Embark on a summer adventure with the new Hero, help him learn his power and find his place among the Guardians!
pt_pt: Embarca numa aventura de verão com o novo Herói, ajuda-o a saber o seu poder e encontra o seu lugar entre os Guardiões!

source: Get new looks for Fafnir, Phobos, and Alvanor!
pt_pt: Novos visuais para Fafnir, Phobos e Alvanor!

source: Conquer everyone with your power and irresistible holiday spirit!
pt_pt: Conquista todos com o teu poder e espírito natalício!

source: Confirm your e-mail to protect your account
pt_pt: Confirma o teu e-mail para protegeres a tua conta

source: The Dominion welcomes the Winterfest!
pt_pt: O Domínio recebe o Festival de Inverno de braços abertos!

source: Take part in a unique event with Elves, get your gifts, and decorate your Winterfest Tree!
pt_pt: Participa num evento único com os Elfos, recebe presentes e decora a Árvore do Festival de Inverno!

source: All of this and much more awaits — the celebrations start on December 22nd!
pt_pt: Tens isto e muito mais à espera a partir de 22/12!

source: Join the event and upgrade Class Runes!
pt_pt: Junta-te ao evento e melhora Runas de Classe!

source: NEW LEGEND -
pt_pt: NOVA LENDA -

source: New Angel Skins White wings are back in style!
pt_pt: Novos Visuais Angélicos As asas brancas estão de volta!

source: Complete event quests and unlock Krista's Skin+!
pt_pt: Conclui missões de eventos e desbloqueia o Visual+ de Krista!

source: Don’t miss out a 60% discount on useful resources!
pt_pt: Não percas este desconto de 60% em recursos úteis!

source: Many centuries ago, the enchanted lands of the Dominion knew an era of unparalleled peace and prosperity. However, these halcyon days met their abrupt end when the ruthless hordes of the Archdemon invaded the land. Their uncompromising cruelty and terrible force routed entire armies. Yet someone must resist—the time has come to rise up and save the Dominion from its cruel captors!
pt_pt: Há muitos séculos, as terras encantadas de Dominion viviam uma era de paz e prosperidade sem paralelo. No entanto, esses dias felizes chegaram a um fim abrupto quando as impiedosas hordas do Archdemon invadiram o território. A sua crueldade impiedosa e força terrível dizimaram exércitos inteiros. Ainda assim, alguém tem de resistir. Chegou o momento de reagir e de salvar o Dominion dos seus cruéis invasores!

source: Celestial Allies
pt_pt: Aliados Celestiais

source: A picture-perfect update!
pt_pt: Uma atualização perfeita!

source: Oriental Event Fafnir, Nebula, and Martha got some new Japanese-style outfits!
pt_pt: Evento Oriental Visuais ao estilo japonês para Fafnir, Nebula e Martha!

source: Complete Quests to purchase valuable resources on discount and Martha's skin upgrades in a special shop!
pt_pt: Conclui missões, adquire recursos valiosos com desconto e as melhorias para o visual de Martha na loja especial!

source: What's with All the Noise?
pt_pt: Que barulheira!

source: You can now hear enemy attacks if the in-game sounds are on!
pt_pt: Se tiveres os efeitos sonoros ativados, já podes ouvir os ataques inimigos!

source: More Interaction There's new feedback to player actions at the Tower levels.
pt_pt: Mais Interação Mais informação acerca das ações dos jogadores nos níveis da Torre.

source: New pause screen The pause screen has been adjusted for a better viewing experience.
pt_pt: Ecrã de Pausa O ecrã de pausa foi melhorado.

source: Keep an eye on your enemies!
pt_pt: Não percas os teus inimigos de vista!

source: UNLOCK NEW LEVELS!
pt_pt: ATINGE NOVOS NÍVEIS!

source: Upgrade your heroes
pt_pt: Melhora os heróis

source: Auto Battle
pt_pt: Sem preocupações

source: A 3-day Greek Skin sale for Cascade, Oya, and Celeste has arrived!
pt_pt: Chegou a promoção Visual Grego de três dias para Cascade, Oya e Celeste!

source: Galahad is the talented commander of the military forces of Harun, the land of honorable knights and skilled armorers. Knowing no fear, he fells one enemy after another, and in November he can become truly unstoppable! Collect Soul Stones for Galahad as a reward for playing daily and help the noble night of the Way of Honor become even stronger! Show your enemies the pride of Harun!
pt_pt: Galahad é o comandante do exército de Harun, uma terra famosa tanto pela honra dos seus cavaleiros como pela mestria dos seus ferreiros. Destemido, não há inimigo que lhe resista e em novembro será verdadeiramente imparável! Joga todos os dias e obtém Pedras Anímicas para Galahad. Ajuda este cavaleiro do Caminho da Honra a tornar-se ainda mais poderoso! Mostra a todos o orgulho de Harun!

source: Join the fun Brawls!
pt_pt: Participa em lutas divertidas!

source: Time to freshen up the Dominion!
pt_pt: Hora de animar o Domínio!

source: Dress up Celeste, K'arkh, Yasmine, and Julius in new outfits and win any battle!
pt_pt: Dá novas fatiotas a Celeste, K'arkh, Yasmine e Julius e prepara-te para vencer as batalhas!
